InformationRegisters/ПараметрыАктуальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАктуальныхОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СмещениеВперед</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СмещениеНазад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАктуальныхОстатков/Ext/ManagerModule.bsl
Процедура ЗаполнитьДанные() Экспорт 
	Организация = ОбщегоНазначенияУВССервер.ОрганизацияТекущегоПользователя();
	Контрагент  = ОбщегоНазначенияУВССервер.КонтрагентПоОрганизации(Организация);
	СписокПредприятия = ОбщегоНазначенияУВСВызовСервера.ПредприятияПоКонтрагенту(Контрагент);
	
	Для Каждого Предприятия Из СписокПредприятия Цикл
		Если Не Предприятия.НеИспользуется Тогда
			НовыеЗаписи = РегистрыСведений.ПараметрыАктуальныхОстатков.СоздатьНаборЗаписей();
			НовыеЗаписи.Отбор.Предприятие.Установить(Предприятия);
			НовыеЗаписи.Отбор.Контрагент.Установить(Контрагент);
			НовыеЗаписи.Отбор.Организация.Установить(Организация);
			НовыеЗаписи.Прочитать();
			Если Не НовыеЗаписи.Количество() > 0 Тогда
				НоваяЗапись = НовыеЗаписи.Добавить();
				НоваяЗапись.Контрагент = Контрагент;
				НоваяЗапись.Организация = Организация;
				НоваяЗапись.Предприятие = Предприятия;
				НоваяЗапись.СмещениеВперед = 600;
				НоваяЗапись.СмещениеНазад  = 3600;
				НовыеЗаписи.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
